tiborsimon/embedded-tdd-headers/pic/pic18/pic18f25k40_tdd.h
#define RA3PPS                        522
#define RA3PPS0                       523
#define RA3PPS1                       524
#define RA3PPS2                       525
#define RA3PPS3                       526
#define RA3PPS4                       527
#define RA4PPS                        528
#define RA4PPS0                       529
#define RA4PPS1                       530
#define RA4PPS2                       531
#define RA4PPS3                       532
#define RA4PPS4                       533
#define RA5PPS                        534
#define RA5PPS0                       535
#define RA5PPS1                       536
#define RA5PPS2                       537
#define RA5PPS3                       538
#define RA5PPS4                       539
#define RA6PPS                        540
#define RA6PPS0                       541
#define RA6PPS1                       542
#define RA6PPS2                       543
#define RA6PPS3                       544
#define RA6PPS4                       545
#define RA7PPS                        546
#define RA7PPS0                       547
#define RA7PPS1                       548
#define RA7PPS2                       549
#define RA7PPS3                       550
#define RA7PPS4                       551
#define RB0PPS                        552
#define RB0PPS0                       553
#define RB0PPS1                       554
#define RB0PPS2                       555
#define RB0PPS3                       556
#define RB0PPS4                       557
#define RB1PPS                        558
#define RB1PPS0                       559
#define RB1PPS1                       560
#define RB1PPS2                       561
#define RB1PPS3                       562
#define RB1PPS4                       563
#define RB2PPS                        564
#define RB2PPS0                       565
#define RB2PPS1                       566
#define RB2PPS2                       567
#define RB2PPS3                       568
#define RB2PPS4                       569
#define RB3PPS                        570
#define RB3PPS0                       571
#define RB3PPS1                       572
#define RB3PPS2                       573
#define RB3PPS3                       574
#define RB3PPS4                       575
#define RB4PPS                        576
#define RB4PPS0                       577
#define RB4PPS1                       578
#define RB4PPS2                       579
#define RB4PPS3                       580
#define RB4PPS4                       581
#define RB5PPS                        582
#define RB5PPS0                       583
#define RB5PPS1                       584
#define RB5PPS2                       585
#define RB5PPS3                       586
#define RB5PPS4                       587
#define RB6PPS                        588
#define RB6PPS0                       589
#define RB6PPS1                       590
#define RB6PPS2                       591
#define RB6PPS3                       592
#define RB6PPS4                       593
#define RB7PPS                        594
#define RB7PPS0                       595
#define RB7PPS1                       596
#define RB7PPS2                       597
#define RB7PPS3                       598
#define RB7PPS4                       599
#define RC0PPS                        600
#define RC0PPS0                       601
#define RC0PPS1                       602
#define RC0PPS2                       603
#define RC0PPS3                       604
#define RC0PPS4                       605
#define RC1PPS                        606
#define RC1PPS0                       607
#define RC1PPS1                       608
#define RC1PPS2                       609
#define RC1PPS3                       610
#define RC1PPS4                       611
#define RC2PPS                        612
#define RC2PPS0                       613
#define RC2PPS1                       614
#define RC2PPS2                       615
#define RC2PPS3                       616
#define RC2PPS4                       617
#define RC3PPS                        618
#define RC3PPS0                       619
#define RC3PPS1                       620
#define RC3PPS2                       621
#define RC3PPS3                       622
#define RC3PPS4                       623
#define RC4PPS                        624
#define RC4PPS0                       625
#define RC4PPS1                       626
#define RC4PPS2                       627
#define RC4PPS3                       628
#define RC4PPS4                       629
#define RC5PPS                        630
#define RC5PPS0                       631
#define RC5PPS1                       632
#define RC5PPS2                       633
#define RC5PPS3                       634
#define RC5PPS4                       635
#define RC6PPS                        636
#define RC6PPS0                       637
#define RC6PPS1                       638
#define RC6PPS2                       639
#define RC6PPS3                       640
#define RC6PPS4                       641
#define RC7PPS                        642
#define RC7PPS0                       643
#define RC7PPS1                       644
#define RC7PPS2                       645
#define RC7PPS3                       646
#define RC7PPS4                       647
#define IOCAF                         648
#define IOCAF0                        649
#define IOCAF1                        650
#define IOCAF2                        651
#define IOCAF3                        652
#define IOCAF4                        653
#define IOCAF5                        654
#define IOCAF6                        655
#define IOCAF7                        656
#define IOCAN                         657
#define IOCAN0                        658
#define IOCAN1                        659
#define IOCAN2                        660
#define IOCAN3                        661
#define IOCAN4                        662
#define IOCAN5                        663
#define IOCAN6                        664
#define IOCAN7                        665
#define IOCAP                         666
#define IOCAP0                        667
#define IOCAP1                        668
#define IOCAP2                        669
#define IOCAP3                        670
#define IOCAP4                        671
#define IOCAP5                        672
#define IOCAP6                        673
#define IOCAP7                        674
#define INLVLA                        675
#define INLVLA0                       676
#define INLVLA1                       677
#define INLVLA2                       678
#define INLVLA3                       679
#define INLVLA4                       680
#define INLVLA5                       681
#define INLVLA6                       682
#define INLVLA7                       683
#define SLRCONA                       684
#define SLRA0                         685
#define SLRA1                         686
#define SLRA2                         687
#define SLRA3                         688
#define SLRA4                         689
#define SLRA5                         690
#define SLRA6                         691
#define SLRA7                         692
#define ODCONA                        693
#define ODCA0                         694
#define ODCA1                         695
#define ODCA2                         696
#define ODCA3                         697
#define ODCA4                         698
#define ODCA5                         699
#define ODCA6                         700
#define ODCA7                         701
#define WPUA                          702
#define WPUA0                         703
#define WPUA1                         704
#define WPUA2                         705
#define WPUA3                         706
#define WPUA4                         707
#define WPUA5                         708
#define WPUA6                         709
#define WPUA7                         710
#define ANSELA                        711
#define ANSELA0                       712
#define ANSELA1                       713
#define ANSELA2                       714
#define ANSELA3                       715
#define ANSELA4                       716
#define ANSELA5                       717
#define ANSELA6                       718
#define ANSELA7                       719
#define IOCBF                         720
#define IOCBF0                        721
#define IOCBF1                        722
#define IOCBF2                        723
#define IOCBF3                        724
#define IOCBF4                        725
#define IOCBF5                        726
#define IOCBF6                        727
#define IOCBF7                        728
#define IOCBN                         729
#define IOCBN0                        730
#define IOCBN1                        731
#define IOCBN2                        732
#define IOCBN3                        733
#define IOCBN4                        734
#define IOCBN5                        735
#define IOCBN6                        736
#define IOCBN7                        737
#define IOCBP                         738
#define IOCBP0                        739
#define IOCBP1                        740
#define IOCBP2                        741
#define IOCBP3                        742
#define IOCBP4                        743
#define IOCBP5                        744
#define IOCBP6                        745
#define IOCBP7                        746
#define INLVLB                        747
#define INLVLB0                       748
#define INLVLB1                       749
#define INLVLB2                       750
#define INLVLB3                       751
#define INLVLB4                       752
#define INLVLB5                       753
#define INLVLB6                       754
#define INLVLB7                       755
#define SLRCONB                       756
#define SLRB0                         757
#define SLRB1                         758
#define SLRB2                         759
#define SLRB3                         760
#define SLRB4                         761
#define SLRB5                         762
#define SLRB6                         763
#define SLRB7                         764
#define ODCONB                        765
#define ODCB0                         766
#define ODCB1                         767
#define ODCB2                         768
#define ODCB3                         769
#define ODCB4                         770
#define ODCB5                         771
#define ODCB6                         772
#define ODCB7                         773
#define WPUB                          774
#define WPUB0                         775
#define WPUB1                         776
#define WPUB2                         777
#define WPUB3                         778
#define WPUB4                         779
#define WPUB5                         780
#define WPUB6                         781
#define WPUB7                         782
#define ANSELB                        783
#define ANSELB0                       784
#define ANSELB1                       785
#define ANSELB2                       786
#define ANSELB3                       787
#define ANSELB4                       788
#define ANSELB5                       789
#define ANSELB6                       790
#define ANSELB7                       791
#define IOCCF                         792
#define IOCCF0                        793
#define IOCCF1                        794
#define IOCCF2                        795
#define IOCCF3                        796
#define IOCCF4                        797
#define IOCCF5                        798
#define IOCCF6                        799
#define IOCCF7                        800
#define IOCCN                         801
#define IOCCN0                        802
#define IOCCN1                        803
#define IOCCN2                        804
#define IOCCN3                        805
#define IOCCN4                        806
#define IOCCN5                        807
#define IOCCN6                        808
#define IOCCN7                        809
#define IOCCP                         810
#define IOCCP0                        811
#define IOCCP1                        812
#define IOCCP2                        813
#define IOCCP3                        814
#define IOCCP4                        815
#define IOCCP5                        816
#define IOCCP6                        817
#define IOCCP7                        818
#define INLVLC                        819
#define INLVLC0                       820
#define INLVLC1                       821
#define INLVLC2                       822
#define INLVLC3                       823
#define INLVLC4                       824
#define INLVLC5                       825
#define INLVLC6                       826
#define INLVLC7                       827
#define SLRCONC                       828
#define SLRC0                         829
#define SLRC1                         830
#define SLRC2                         831
#define SLRC3                         832
#define SLRC4                         833
#define SLRC5                         834
#define SLRC6                         835
#define SLRC7                         836
#define ODCONC                        837
#define ODCC0                         838
#define ODCC1                         839
#define ODCC2                         840
#define ODCC3                         841
#define ODCC4                         842
#define ODCC5                         843
#define ODCC6                         844
#define ODCC7                         845
#define WPUC                          846
#define WPUC0                         847
#define WPUC1                         848
#define WPUC2                         849
#define WPUC3                         850
#define WPUC4                         851
#define WPUC5                         852
#define WPUC6                         853
#define WPUC7                         854
#define ANSELC                        855
#define ANSELC0                       856
#define ANSELC1                       857
#define ANSELC2                       858
#define ANSELC3                       859
#define ANSELC4                       860
#define ANSELC5                       861
#define ANSELC6                       862
#define ANSELC7                       863
#define IOCEF                         864
#define IOCEF3                        865
#define IOCEN                         866
#define IOCEN3                        867
#define IOCEP                         868
#define IOCEP3                        869
#define INLVLE                        870
#define INLVLE3                       871
#define WPUE                          872
#define WPUE3                         873
#define HLVDCON0                      874
#define INTL                          875
#define HLVDINTL                      876
#define INTH                          877
#define HLVDINTH                      878
#define RDY                           879
#define HLVDRDY                       880
#define HLVDCON0_OUT                  881
#define HLVDOUT                       882
#define HLVDEN                        883
#define HLVDCON0_EN                   884
#define HLVDCON1                      885
#define HLVDSEL0                      886
#define SEL                           887
#define SEL0                          888
#define HLVDSEL1                      889
#define SEL1                          890
#define HLVDSEL2                      891
#define SEL2                          892
#define HLVDSEL3                      893
#define SEL3                          894
#define FVRCON                        895
#define ADFVR0                        896
#define ADFVR                         897
#define ADFVR1                        898
#define CDAFVR                        899
#define CDAFVR0                       900
#define CDAFVR1                       901
#define TSRNG                         902
#define TSEN                          903
#define FVRRDY                        904
#define FVREN                         905
#define ZCDCON                        906
#define ZCDINTN                       907
#define ZCDINTP                       908
#define ZCDPOL                        909
#define ZCDOUT                        910
#define ZCDSEN                        911
#define DAC1CON0                      912
#define NSS                           913
#define DAC1NSS                       914
#define DAC1PSS0                      915
#define PSS                           916
#define PSS0                          917
#define PSS1                          918
#define DAC1PSS1                      919
#define OE2                           920
#define DAC1OE2                       921
#define OE1                           922
#define DAC1OE1                       923
#define DAC1CON0_EN                   924
#define DAC1EN                        925
#define DAC1CON1                      926
#define DAC1R                         927
#define DAC1R0                        928
#define DAC1R1                        929
#define DAC1R2                        930
#define DAC1R3                        931
#define DAC1R4                        932
#define CM2CON0                       933
#define CM2CON0_SYNC                  934
#define C2SYNC                        935
#define C2HYS                         936
#define CM2CON0_HYS                   937
#define C2POL                         938
#define CM2CON0_POL                   939
#define CM2CON0_OUT                   940
#define C2OUT                         941
#define C2EN                          942
#define CM2CON0_EN                    943
#define CM2CON1                       944
#define C2INTN                        945
#define CM2CON1_INTN                  946
#define CM2CON1_INTP                  947
#define C2INTP                        948
#define CM2NCH                        949
#define C2NCH0                        950
#define CM2NCH_NCH0                   951
#define CM2NCH_NCH                    952
#define C2NCH1                        953
#define CM2NCH_NCH1                   954
#define C2NCH2                        955
#define CM2NCH_NCH2                   956
#define CM2PCH                        957
#define CM2PCH_PCH                    958
#define C2PCH0                        959
#define CM2PCH_PCH0                   960
#define C2PCH1                        961
#define CM2PCH_PCH1                   962
#define C2PCH2                        963
#define CM2PCH_PCH2                   964
#define CM1CON0                       965
#define CM1CON0_SYNC                  966
#define C1SYNC                        967
#define CM1CON0_HYS                   968
#define C1HYS                         969
#define CM1CON0_POL                   970
#define C1POL                         971
#define C1OUT                         972
#define CM1CON0_OUT                   973
#define CM1CON0_EN                    974
#define C1EN                          975
#define CM1CON1                       976
#define C1INTN                        977
#define CM1CON1_INTN                  978
#define CM1CON1_INTP                  979
#define C1INTP                        980
#define CM1NCH                        981
#define C1NCH0                        982
#define CM1NCH_NCH0                   983
#define CM1NCH_NCH                    984
#define C1NCH1                        985
#define CM1NCH_NCH1                   986
#define C1NCH2                        987
#define CM1NCH_NCH2                   988
#define CM1PCH                        989
#define CM1PCH_PCH0                   990
#define C1PCH0                        991
#define CM1PCH_PCH                    992
#define CM1PCH_PCH1                   993
#define C1PCH1                        994
#define CM1PCH_PCH2                   995
#define C1PCH2                        996
#define CMOUT                         997
#define MC1OUT                        998
#define MC2OUT                        999
#define CLKRCON                       1000
#define CLKRDIV0                      1001
#define DIV                           1002
#define DIV0                          1003
#define CLKRDIV1                      1004
#define DIV1                          1005
#define DIV2                          1006
#define CLKRDIV2                      1007
#define CLKRCON_DC                    1008
#define CLKRCON_DC0                   1009
#define CLKRDC0                       1010
#define CLKRCON_DC1                   1011
#define CLKRDC1                       1012
#define CLKRCON_EN                    1013
#define CLKREN                        1014
#define CLKRCLK                       1015
#define CLKRCLK0                      1016
#define CLK                           1017
#define CLK0                          1018
#define CLKRCLK1                      1019
#define CLK1                          1020
#define CLKRCLK2                      1021
#define CLK2                          1022
#define CWG1CLKCON                    1023
#define CWG1CLKCON_CS                 1024
#define CWG1CS                        1025
#define CWG1ISM                       1026
#define CWG1ISM0                      1027
#define IS                            1028
#define CWG1ISM1                      1029
#define CWG1ISM2                      1030
#define CWG1ISM3                      1031
#define CWG1DBR0                      1032
#define CWG1DBR                       1033
#define DBR                           1034
#define DBR0                          1035
#define CWG1DBR1                      1036
#define DBR1                          1037
#define CWG1DBR2                      1038
#define DBR2                          1039
#define CWG1DBR3                      1040
#define DBR3                          1041
#define CWG1DBR4                      1042
#define DBR4                          1043
#define CWG1DBR5                      1044
#define DBR5                          1045
#define CWG1DBF                       1046
#define CWG1DBF0                      1047
#define DBF                           1048
#define DBF0                          1049
#define CWG1DBF1                      1050
#define DBF1                          1051
#define CWG1DBF2                      1052
#define DBF2                          1053
#define CWG1DBF3                      1054
#define DBF3                          1055
#define CWG1DBF4                      1056
#define DBF4                          1057
#define DBF5                          1058
#define CWG1DBF5                      1059
#define CWG1CON0                      1060
#define CWG1MODE0                     1061
#define CWG1CON0_MODE                 1062
#define CWG1CON0_MODE0                1063
#define CWG1MODE                      1064
#define CWG1MODE1                     1065
#define CWG1CON0_MODE1                1066
#define CWG1MODE2                     1067
#define CWG1CON0_MODE2                1068
#define LD                            1069
#define CWG1LD                        1070
#define CWG1EN                        1071
#define G1EN                          1072
#define CWG1CON0_EN                   1073
#define CWG1CON1                      1074
#define CWG1POLA                      1075
#define POLA                          1076
#define CWG1POLB                      1077
#define POLB                          1078
#define CWG1POLC                      1079
#define POLC                          1080
#define CWG1POLD                      1081
#define POLD                          1082
#define IN                            1083
#define CWG1IN                        1084
#define CWG1AS0                       1085
#define CWG1LSAC                      1086
#define LSAC                          1087
#define LSAC0                         1088
#define CWG1LSAC0                     1089
#define LSAC1                         1090
